.tsung/viewCreateComments.xml
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE tsung SYSTEM "/usr/local/Cellar/tsung/1.7.0/share/tsung/tsung-1.0.dtd">

<tsung loglevel="notice" version="1.0">
  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>

  <servers>
    <server host="localhost" port="3000" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <!-- <arrivalphase phase="2" duration="60" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase> -->
  </load>

  <options>
    <option name="file_server" id="userlist" value="/Users/brandon/Desktop/291a/PANDA/.tsung/user.csv" />
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <transaction name="LOG_IN">
        <setdynvars sourcetype="file" fileid="userlist" delimiter="," order="iter">
          <var name="name" />
          <var name="password" />
          <var name="email" />
          <var name="points" />
        </setdynvars>
        <request>
          <dyn_variable name="authenticity_token" xpath="/html/head/meta[@name='csrf-token']/@content"></dyn_variable>
          <http url="/" method="GET" version="1.1"></http>
        </request>
        <!-- user click on login button to fill in form -->
        <request> <http url="/login" method="GET" version="1.1"></http> </request>
        <!-- user is filling login form -->
        <thinktime value="3" random="true"></thinktime>
        <request subst="true">
          <dyn_variable name="loginstatus" re="(.*)"/>
          <dyn_variable name="userid" re="Location: http://.*/users/(.*)\r" />
          <http
            url="/login"
            contents='authenticity_token=%%_authenticity_token%%&amp;session[email]=%%_email%%&amp;session[password]=test'
            method="POST"
            version="1.1">
          </http>
        </request>
      </transaction>

      <!-- <transaction name="VIEW_POST">
        <request>
          <dyn_variable name="tag_id" re="[Ll]ocation: http://.*/tags/(.*)\r"></dyn_variable>
          <http url="/tags" method="GET" version="1.1" />
        </request>

        <request subst="true">\
            <http url="/posts/%%_post_id%%" method="GET" version="1.1" />
        </request>
      </transaction> -->

    </session>
  </sessions>
</tsung>