.tsung/viewCreateComments.xml
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE tsung SYSTEM "/usr/local/Cellar/tsung/1.7.0/share/tsung/tsung-1.0.dtd">

<tsung loglevel="notice" version="1.0">
  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>

  <servers>
    <server host="panda.eba-gaci4fx8.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="30" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="30" unit="second">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="6" duration="30" unit="second">
      <users arrivalrate="64" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <option name="file_server" id="userlist" value="/Users/brandon/Desktop/291a/PANDA/.tsung/user.csv" />
    <!-- <option name="file_server" id="userlist" value="/home/ec2-user/user.csv" /> -->
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <transaction name="LOG_IN">
        <setdynvars sourcetype="file" fileid="userlist" delimiter="," order="iter">
          <var name="name" />
          <var name="password" />
          <var name="email" />
          <var name="points" />
        </setdynvars>
        <request>
          <dyn_variable name="authenticity_token" xpath="/html/head/meta[@name='csrf-token']/@content"></dyn_variable>
          <http url="/" method="GET" version="1.1"></http>
        </request>
        <!-- user click on login button to fill in form -->
        <request> <http url="/login" method="GET" version="1.1"></http> </request>
        <!-- user is filling login form -->
        <thinktime value="3" random="true"></thinktime>
        <request subst="true">
          <dyn_variable name="loginstatus" re="(.*)"/>
          <dyn_variable name="userid" re="Location: http://.*/users/(.*)\r" />
          <http
            url="/login"
            contents='authenticity_token=%%_authenticity_token%%&amp;session[email]=%%_email%%&amp;session[password]=test'
            method="POST"
            version="1.1">
          </http>
        </request>
      </transaction>

      <transaction name="VIEW_POST">
        <setdynvars sourcetype="random_number" start="1" end="100">
          <var name="randpostid"/>
        </setdynvars>
        <request subst='true'>
          <http url="/posts/%%_randpostid%%" method="GET" version="1.1" />
        </request>

        <setdynvars sourcetype="random_string" length="20">
          <var name="commentbody"/>
        </setdynvars>
        <request subst="true">
          <dyn_variable name="postquest" re="(.*)"/>
          <dyn_variable name="postid2" re="Location: http://.*/posts/(.*)\r" />
          <http
            url="/posts/%%_randpostid%%/comments"
            contents='authenticity_token=%%_authenticity_token%%&amp;comment[body]=%%_commentbody%%&amp;comment[user_id]=%%_userid%%&amp;comment[post_id]=%%_randpostid%%'
            method="POST"
            version="1.1">
          </http>
        </request>
      </transaction>

      <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->
      io:format([126, $p, 126, $n, 126, $n], [DynVars]),
      ok end.">
      </setdynvars>

    </session>
  </sessions>
</tsung>